app/controllers/message_rooms_controller.rb

	def index
		@message_rooms = MessageRoomDecorator.decorate_collection(MessageRoom.all)
---
SELECT "message_rooms".* FROM "message_rooms"

	def show
		@message_room = MessageRoom.find(params[:id])
---
SELECT  "message_rooms".* FROM "message_rooms" WHERE "message_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@message_room = current_user.message_rooms.new(room_params)
		if @message_room.save
---
INSERT INTO "message_rooms" ("room_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["room_name", "test"], ["user_id", 1], ["created_at", "2021-03-06 06:22:15.154425"], ["updated_at", "2021-03-06 06:22:15.154425"]]